{
  "irVersion": "1",
  "harness": null,
  "harnessVersion": null,
  "sessionId": null,
  "toolUseId": null,
  "agentIdentity": null,
  "ts": null,
  "cwd": null,
  "projectRoot": null,
  "branch": null,
  "envDelta": {},
  "tool": null,
  "toolKind": "unknown",
  "command": "",
  "commandTokens": [],
  "commandClass": "unknown",
  "argv0": null,
  "fileTargets": [],
  "networkTargets": [],
  "mcpServer": null,
  "skillName": null,
  "writeIntent": false,
  "destructive": false,
  "payloadClass": "A",
  "outputChannels": {
    "toolOutput": "none",
    "generatedFiles": "none",
    "commitText": "none",
    "prText": "none",
    "finalMessage": "none",
    "terminal": "none",
    "screenshots": "none"
  },
  "declaredGoal": null,
  "planEnvelopeId": null,
  "trustMeta": {
    "envelopeReporting": false,
    "argsFidelity": "best-effort",
    "cwdFidelity": "best-effort",
    "mcpInterception": "unverified",
    "skillInterception": "unverified"
  },
  "rawPayloadHash": null,
  "irHash": null
}
